# ========================== СПИСКИ ==========================
# x = [9, 8, 7, 6, 5, 4, 3]
# x.count(1)                  # считает сколько элементов 1 в списке
# x.append(10)                # добавляет элемент в конец списка
# x.insert(0, 22)             # добавляет элемент элемент 22 на 0 индекс 
# x.sort()                    # сортирует по возрастанию
# x.reverse()                 # записывает в обратном порядке
# x.remove(5)                 # удаляет первый попавшийся элемент равный 5
# x.clear()                   # полностью очищает список
# x.extend(['a', 's'])        # в конец списка добавляет элементы из другого списка
# h = x.copy()                # копирует список
# y = x[0::2]                 # в список у запишет значения из списка х от 0 и до конца, с шагом 2
# y = x[:10:3]                # в список у запишет значения из списка х от начала и до 10, с шагом 3
# y = x[::]                   # в список у запишет значения все значения из списка х (типа скопирует)
# x = list(range(1,10))       # в ч запишет список от 1 до 9 включительно

# ========================== КОРТЕЖИ ==========================
# x = (9, 8, 7, 6, 5, 4)
# Кортеж - это не изменяемый список данных, то есть нельзя записать
# x[0] = 100, выдаст ошибку, так как нельзя внести изменения в кортеж

